Repository: thomasgalliker/OpenWeatherMap.API
Catalog: OpenWeatherMap/Resources/Strings/WeatherConditionCodes.*.resx
Languages: it

source: Thunderstorm with light rain
it: Temporali con pioggia leggera

source: Thunderstorm with rain
it: Temporale con pioggia

source: Thunderstorm with heavy rain
it: Temporali con pioggia battente

source: Light thunderstorm
it: Leggero temporale

source: Thunderstorm
it: Temporale

source: Heavy thunderstorm
it: Forti temporali

source: Extremely heavy thunderstorm
it: Fortissimo temporale

source: Thunderstorm with light drizzle
it: Temporali con leggera pioggerellina

source: Thunderstorm with drizzle
it: Temporali con pioggerellina

source: Thunderstorm with heavy drizzle
it: Temporali con pioviggine pesante

source: Light intensity drizzle
it: Pioggerellina di intensità luminosa

source: Drizzle
it: Pioggerella

source: Heavy intensity drizzle
it: Pioggerellina di forte intensità

source: Light intensity drizzle rain
it: Pioggia piovigginosa di leggera intensità

source: Drizzle rain
it: Pioggia piovigginosa

source: Heavy intensity drizzle rain
it: Pioggia piovigginosa di forte intensità

source: Shower rain and drizzle
it: Pioggia e pioviggine

source: Heavy shower rain and drizzle
it: Pioggia e pioviggine

source: Shower drizzle
it: Doccia pioviggina

source: Light rain
it: Pioggia leggera

source: Moderate rain
it: Pioggia moderata

source: Heavy intensity rain
it: Pioggia intensa

source: Very heavy rain
it: Pioggia molto forte

source: Extreme rain
it: Pioggia estrema

source: Freezing rain
it: Pioggia gelata

source: Light intensity shower rain
it: Pioggia pioggia di intensità luminosa

source: Shower rain
it: Pioggia a pioggia

source: Heavy intensity shower rain
it: Pioggia a pioggia di forte intensità

source: Extreme shower rain
it: Pioggia estrema della pioggia

source: Light snow
it: Neve leggera

source: Snow
it: Neve

source: Heavy snow
it: Nevicate

source: Sleet
it: Nevischio

source: Light shower sleet
it: Nevischio doccia leggero

source: Shower sleet
it: Mostra nevischio

source: Light rain and snow
it: Pioggia leggera e neve

source: Rain and snow
it: Pioggia e neve

source: Light shower snow
it: Pioggia leggera neve

source: Shower snow
it: Doccia neve

source: Heavy shower snow
it: Pioggia di neve pesante

source: Mist
it: Nebbia

source: Smoke
it: Fumo

source: Haze
it: Nebbia

source: Sand/dust whirls
it: Vortici di sabbia/polvere

source: Fog
it: Giuntura

source: Sand
it: Sabbia

source: Dust
it: Bagarre

source: Volcanic ash
it: Cenere vulcanica

source: Squalls
it: Burrasche

source: Clear sky
it: Cielo sereno

source: Few clouds: 11-25%
it: Poche nuvole: 11-25%

source: Scattered clouds: 25-50%
it: Nuvolosità sparse: 25-50%

source: Broken clouds: 51-84%
it: Nuvole spezzate: 51-84%

source: Overcast clouds: 85-100%
it: Nuvolosità nuvoloso: 85-100%
